In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [4]:
s1 = Series([1,2,3], index= ['a','b','c'])
s1

a    1
b    2
c    3
dtype: int64

In [5]:
s1['a']=2
s1

a    2
b    2
c    3
dtype: int64

In [6]:
'b' in s1

True

In [8]:
data = {'a':1,'b':2}
index = ['a','c']
s1 = Series(data, index)
s1

a    1.0
c    NaN
dtype: float64

In [9]:
s2 = Series([1,2],index=['a','b'])
s1 + s2

a    2.0
b    NaN
c    NaN
dtype: float64

In [10]:
s1.name = 'test'

In [11]:
s1

a    1.0
c    NaN
Name: test, dtype: float64

In [19]:
df1 = DataFrame({'s1':s1,'s2':s2})
df1

    s1   s2
a  1.0  1.0
b  NaN  2.0
c  NaN  NaN

In [20]:
df1.s1

a    1.0
b    NaN
c    NaN
Name: s1, dtype: float64

In [21]:
del df1['s1']
df1

    s2
a  1.0
b  2.0
c  NaN

In [17]:
df1

    s2
a  1.0
b  2.0
c  NaN

In [38]:
df2 = DataFrame({'s1':Series([1,2],index=['a','b']),'s2':Series([1,2,3],index={'a','c','d'})})
df2

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  3.0
d  NaN  2.0

In [25]:
df2.values

array([[ 1.,  1.],
       [ 2., nan],
       [nan,  3.],
       [nan,  2.]])

In [26]:
df2.reindex(['a','b','c','d','e'])

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  3.0
d  NaN  2.0
e  NaN  NaN

In [33]:
df2.reindex(columns=['s1','s3'])

    s1  s3
a  1.0 NaN
b  2.0 NaN
c  NaN NaN
d  NaN NaN

In [35]:
df2.loc[:'b']

    s1   s2
a  1.0  1.0
b  2.0  NaN

In [39]:
df2

    s1   s2
a  1.0  1.0
b  2.0  NaN
c  NaN  3.0
d  NaN  2.0

In [40]:
df3 = DataFrame({'s1': Series([1,1,1],index=['b','c','d']),'s3':Series([1,2,1],index=['b','c','d'])})

In [41]:
df3

   s1  s3
b   1   1
c   1   2
d   1   1

In [42]:
df2 + df3

    s1  s2  s3
a  NaN NaN NaN
b  3.0 NaN NaN
c  NaN NaN NaN
d  NaN NaN NaN

In [43]:
df3.rdiv(1) # = 1/df3

    s1   s3
b  1.0  1.0
c  1.0  0.5
d  1.0  1.0

In [44]:
df2.add(df3, fill_value=0)

    s1   s2   s3
a  1.0  1.0  NaN
b  3.0  NaN  1.0
c  1.0  3.0  2.0
d  1.0  2.0  1.0